#include "vector.h"

// --------------------------------------------------------------------------

int push(int elem) {
    if (stack.top < STACK_SIZE) {
        stack.stack[stack.top++] = elem;
        return 0;
    }
    puts("Отказано: переполнение стека.");
    return 1;
}

// --------------------------------------------------------------------------

int pop(int *operand) {
    if (stack.top) {
        *operand = stack.stack[--stack.top];
        return 0;
    }
    puts("Отказано: пустой стек.");
    return 1;
}

// --------------------------------------------------------------------------

int getStackSize() {
    return stack.top;
}

// --------------------------------------------------------------------------

void eraseStack() {
    stack.top = 0;
}

// --------------------------------------------------------------------------